In [1]:
import pandas as pd

In [ ]:
{'id':[12,11,13]}

In [9]:
df = pd.DataFrame({'id':[12,11,13,15]})

In [10]:
df

   id
0  12
1  11
2  13
3  15

In [11]:
mdict = {12:'Василий', 11: 'Alex' , 13:'Anna'}

In [12]:
df.id.map(mdict)

0    Василий
1       Alex
2       Anna
3        NaN
Name: id, dtype: object

In [13]:
df['Name'] = df.id.map(mdict)

In [14]:
df

   id     Name
0  12  Василий
1  11     Alex
2  13     Anna
3  15      NaN